/*
5. Пользователь вводит с клавиатуры время в секундах, прошедшее с
начала рабочего дня. Посчитать, сколько целых часов ему осталось
сидеть на работе, если рабочий день составляет 8 часов.
*/

#include<iostream>
#include <Windows.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, ""); //працює тільки з потоком виведення
	SetConsoleCP(1251); //встановлює потрібну кодову таблицю, на потік введення
	SetConsoleOutputCP(1251); //встановлює потрібну кодову таблицю, на потік виводу

	cout << "Введите время в секундах, прошедшее с начала рабочего дня: \n";
	int time_passed_s{ 0 };
	cin >> time_passed_s; // 11545. Прошло секунд из 8-часового рабочего дня

	cout << "До конца рабочего дня осталось "
		<< int((8 - (time_passed_s / 60 / 60)) - 0.5) //8-3,206944444444444=4,793055555555556
		<< " ч." << endl;

	return 0;
}
