/*
5. Пользователь вводит с клавиатуры время в секундах, прошедшее с
начала рабочего дня. Посчитать, сколько целых часов ему осталось
сидеть на работе, если рабочий день составляет 8 часов.
*/

#include<iostream>
#include <Windows.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, ""); //працює тільки з потоком виведення
	SetConsoleCP(1251); //встановлює потрібну кодову таблицю, на потік введення
	SetConsoleOutputCP(1251); //встановлює потрібну кодову таблицю, на потік виводу



	return 0;
}