/*
2. Пользователь вводит с клавиатуры массу в тоннах (дробное число).
Вывести по отдельности количество тонн, килограмм, грамм (например,
ввести 126.456789т - получить и вывести 126т 456кг 789г)
*/

#include<iostream>
#include <Windows.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, ""); //працює тільки з потоком виведення
	SetConsoleCP(1251); //встановлює потрібну кодову таблицю, на потік введення
	SetConsoleOutputCP(1251); //встановлює потрібну кодову таблицю, на потік виводу

	return 0;
}