/*
3. Пользователь вводит с клавиатуры время начала и время завершения
телефонного разговора (часы, минуты и секунды). Посчитать стоимость
разговора, если стоимость минуты составляет 30 копеек.
*/

#include<iostream>
#include <Windows.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, ""); //працює тільки з потоком виведення
	SetConsoleCP(1251); //встановлює потрібну кодову таблицю, на потік введення
	SetConsoleOutputCP(1251); //встановлює потрібну кодову таблицю, на потік виводу

	return 0;
}