/*
4. Пользователь вводит с клавиатуры сумму в гривнах и курс доллара, евро
и рубля. Посчитать, сколько пользователь сможет купить долларов, евро
и рублей. При этом количество долларов, евро и рублей должно быть
целым. Дополнительно вывести на экран сдачу в гривнах.
*/

#include<iostream>
#include <Windows.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, ""); //працює тільки з потоком виведення
	SetConsoleCP(1251); //встановлює потрібну кодову таблицю, на потік введення
	SetConsoleOutputCP(1251); //встановлює потрібну кодову таблицю, на потік виводу

	return 0;
}